#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-0c5287c3a02b5a8df]
data.aws_subnets.subnets: Reading...
data.aws_subnets.private_subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-00bdec62fbecb7ae5"]: Reading...
data.aws_subnet.subnet["subnet-072a68e94706e31a0"]: Reading...
data.aws_subnet.subnet["subnet-0e748af68faa556cf"]: Reading...
data.aws_subnet.subnet["subnet-0849eb27ea73563ad"]: Reading...
data.aws_subnets.private_subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.private_subnet["subnet-0849eb27ea73563ad"]: Reading...
data.aws_subnet.private_subnet["subnet-072a68e94706e31a0"]: Reading...
data.aws_subnet.subnet["subnet-00bdec62fbecb7ae5"]: Read complete after 0s [id=subnet-00bdec62fbecb7ae5]
data.aws_subnet.subnet["subnet-072a68e94706e31a0"]: Read complete after 0s [id=subnet-072a68e94706e31a0]
data.aws_subnet.private_subnet["subnet-072a68e94706e31a0"]: Read complete after 0s [id=subnet-072a68e94706e31a0]
data.aws_subnet.subnet["subnet-0e748af68faa556cf"]: Read complete after 0s [id=subnet-0e748af68faa556cf]
data.aws_subnet.subnet["subnet-0849eb27ea73563ad"]: Read complete after 0s [id=subnet-0849eb27ea73563ad]
data.aws_subnet.private_subnet["subnet-0849eb27ea73563ad"]: Read complete after 0s [id=subnet-0849eb27ea73563ad]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.tc_pg_db will be created
  + resource "aws_db_instance" "tc_pg_db" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "lanchonetedobairro"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "tc-pg-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres16"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "LanchoneteDoBairroDB"
        }
      + tags_all                              = {
          + "Name" = "LanchoneteDoBairroDB"
        }
      + timezone                              = (known after apply)
      + username                              = "tc3user"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.rds_subnet_group will be created
  + resource "aws_db_subnet_group" "rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Subnet group for my private PostgreSQL database"
      + id                      = (known after apply)
      + name                    = "lanchonete-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-072a68e94706e31a0",
          + "subnet-0849eb27ea73563ad",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = (known after apply)
      + vpc_id                  = (known after apply)
    }

  # aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "sg_rds_lanchonete-do-bairro"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0c5287c3a02b5a8df"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*